
## Terraform plan for environment: `dev`

**Commit:** 9c73a954696695f341d1ea2f702f14244b117a8f


**API version:** 988f85a
**Selfserve version:** 988f85a
**Internal version:** 988f85a

### Plan summary

`4 to add, 0 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.batch.aws_batch_compute_environment.this["a_fargate"]
module.service.module.batch.aws_batch_compute_environment.this["b_fargate_spot"]
module.service.module.batch.aws_batch_job_queue.this["high_priority"]
module.service.module.batch.aws_batch_job_queue.this["low_priority"]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_compute_environment.this["a_fargate"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "batch-app-fargate-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = "arn:aws:iam::054614622558:role/batch/dev-batch-app-batch-role-20240705091350939600000001"
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + max_vcpus          = 4
          + security_group_ids = [
              + "dev =\"dev\" ? format(\"%s/%s\",\"DEV/APP\",upper(var.environment)) : upper(var.environment)}-OLCS-PRI-API-SG",
            ]
          + subnets            = [
              + "dev =\"dev\" ? format(\"%s/%s\",\"DEV/APP\",upper(var.environment)) : upper(var.environment)}-OLCS-PRI-BATCH-1A",
              + "dev =\"dev\" ? format(\"%s/%s\",\"DEV/APP\",upper(var.environment)) : upper(var.environment)}-OLCS-PRI-BATCH-1B",
              + "dev =\"dev\" ? format(\"%s/%s\",\"DEV/APP\",upper(var.environment)) : upper(var.environment)}-OLCS-PRI-BATCH-1C",
            ]
          + type               = "FARGATE"

          + ec2_configuration (known after apply)
        }
    }

  # module.service.module.batch.aws_batch_compute_environment.this["b_fargate_spot"] will be created
  + resource "aws_batch_compute_environment" "this" {
      + arn                             = (known after apply)
      + compute_environment_name        = (known after apply)
      + compute_environment_name_prefix = "batch-app-fargate_spot-"
      + ecs_cluster_arn                 = (known after apply)
      + id                              = (known after apply)
      + service_role                    = "arn:aws:iam::054614622558:role/batch/dev-batch-app-batch-role-20240705091350939600000001"
      + state                           = "ENABLED"
      + status                          = (known after apply)
      + status_reason                   = (known after apply)
      + tags_all                        = {
          + "Environment" = "dev"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
      + type                            = "MANAGED"

      + compute_resources {
          + desired_vcpus      = (known after apply)
          + max_vcpus          = 4
          + security_group_ids = [
              + "dev =\"dev\" ? format(\"%s/%s\",\"DEV/APP\",upper(var.environment)) : upper(var.environment)}-OLCS-PRI-API-SG",
            ]
          + subnets            = [
              + "dev =\"dev\" ? format(\"%s/%s\",\"DEV/APP\",upper(var.environment)) : upper(var.environment)}-OLCS-PRI-BATCH-1A",
              + "dev =\"dev\" ? format(\"%s/%s\",\"DEV/APP\",upper(var.environment)) : upper(var.environment)}-OLCS-PRI-BATCH-1B",
              + "dev =\"dev\" ? format(\"%s/%s\",\"DEV/APP\",upper(var.environment)) : upper(var.environment)}-OLCS-PRI-BATCH-1C",
            ]
          + type               = "FARGATE_SPOT"

          + ec2_configuration (known after apply)
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["high_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestHighPriorityFargate"
      + priority              = 99
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestHighPriorityFargate"
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "High priority job queue"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "JobQueue"    = "High priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

  # module.service.module.batch.aws_batch_job_queue.this["low_priority"] will be created
  + resource "aws_batch_job_queue" "this" {
      + arn                   = (known after apply)
      + compute_environments  = [
          + (known after apply),
          + (known after apply),
        ]
      + id                    = (known after apply)
      + name                  = "BatchTestLowPriorityFargate"
      + priority              = 1
      + scheduling_policy_arn = "arn:aws:batch:eu-west-1:054614622558:scheduling-policy/BatchTestLowPriorityFargate"
      + state                 = "ENABLED"
      + tags                  = {
          + "JobQueue" = "Low priority job queue"
        }
      + tags_all              = {
          + "Environment" = "dev"
          + "JobQueue"    = "Low priority job queue"
          + "Repository"  = "https://github.com/dvsa/vol-app"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

```

</details>